Ontaelio/STM32F103-Ublink-framework/stm32f103_i2c_master.cpp
/*
 * STM32F103 I2C Master library source
 * Part of STM32F103 register and peripherals library
 *
 * Dpcumentation available in the provided MD file.
 *
 * (c) 2019 Dmitry Reznikov ontaelio(at)gmail.com
 *
 * Can be freely used according to the GNU GPL license.
 */


#include <stdio.h>
#include <stm32f103_gpio_reg.h>
#include <stm32f103_i2c_reg.h>
#include <stm32f103_rcc_reg.h>
#include <stm32f103_i2c_master.h>
//#include <stm32f103_debugLED.h>

/* ----------- I2C1 -------------------- */

i2c1::i2c1(uint8_t address, uint8_t address_bits): device_addr(address), word_addr(address_bits > 8)
{
	//if (address_bits > 8) word_addr = 1; else word_addr = 0;
}

void i2c1::startAndSendRegisterAddress(uint16_t regaddr)
{
	i2c1_start(device_addr);
	if (word_addr) i2c1_writeByte(regaddr>>8);
	i2c1_writeByte(regaddr&0xFF);
}

void i2c1::write(uint16_t addr, uint8_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c1_writeLast(stuff);
	i2c1_stop();
}

void i2c1::write16(uint16_t addr, uint16_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c1_writeByte(stuff>>8);
	i2c1_writeLast(stuff&0xFF);
	i2c1_stop();
}

void i2c1::write32(uint16_t addr, uint32_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c1_writeByte(stuff>>24);
	i2c1_writeByte(stuff>>16);
	i2c1_writeByte(stuff>>8);
	i2c1_writeLast(stuff&0xFF);
	i2c1_stop();
}

void i2c1::writeStream(uint16_t addr, uint8_t* stuff, uint8_t num)
{
	startAndSendRegisterAddress(addr);
	i2c1_writeStream(stuff, num);
	i2c1_stop();
}

uint8_t i2c1::read(uint16_t addr)
{
	uint8_t result;
	startAndSendRegisterAddress(addr);
	//i2c1_readStart(device_addr);
	result = i2c1_readOneByte(device_addr);
	//i2c1_stop();
	return(result);
}

uint16_t i2c1::read16(uint16_t addr)
{
	uint16_t result;
	startAndSendRegisterAddress(addr);
	result = i2c1_readFirstOfTwo(device_addr)<<8;
	result |= i2c1_DR();
	return result;
}

uint32_t i2c1::read32(uint16_t addr)
{
	uint32_t result;
	uint8_t arr[4];
	startAndSendRegisterAddress(addr);
	i2c1_readStreamMethod2 (device_addr, arr, 4);
	result = (arr[0]<<24) | (arr[1]<<16) | arr[2] << 8 | arr[3];
	return result;
}

void i2c1::readStream(uint16_t addr, uint8_t* arr, uint8_t num)
{
	startAndSendRegisterAddress(addr);
	if (num>3)	i2c1_readStreamMethod2(device_addr, arr, num);
	else if (num == 3)
	{
		*arr = i2c1_readFirstOfThree(device_addr);
		arr++;
		*arr = i2c1_DR();
		arr++;
		i2c1_checkRXNE();
		*arr = i2c1_DR();
	}
	else if (num == 2)
	{
		*arr = i2c1_readFirstOfTwo(device_addr);
		arr++;
		*arr = i2c1_DR();
	}
	else if (num == 1)
	{
		*arr = i2c1_readOneByte(device_addr);
	}

	/* previous version
	i2c1_readStart(device_addr);
	i2c1_readStream(arr, num);
	i2c1_stop();*/
}

uint8_t i2c1_resetBus(uint8_t altpins)
{
	uint8_t pinSDA = 7, pinSCL = 6;

	//turn GPIOB on
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN;

	//setup pins and pin variables for AF
	//SDA: input floating
	//SCL: output open drain
	if (altpins == I2C1_ALT)
		{
		pinSDA = 9;
		pinSCL = 8;

		//setup SCL as high impedance
		_GPIOB_(GPIOX_BSRR) = 1<<pinSCL;
		_GPIOB_(GPIOX_CRH) &= ~(CNF9_1 | CNF8_1);
		_GPIOB_(GPIOX_CRH) |= CNF9_0 | CNF8_0;
		_GPIOB_(GPIOX_CRH) &= ~(MODE9_0 | MODE9_1 | MODE8_0);
		_GPIOB_(GPIOX_CRH) |= MODE8_1;
		}
	else
	{
		//setup SCL as high impedance
		_GPIOB_(GPIOX_BSRR) = 1<<pinSCL;
		_GPIOB_(GPIOX_CRL) &= ~(CNF7_1 | CNF6_1);
		_GPIOB_(GPIOX_CRL) |= CNF7_0 | CNF6_0;
		_GPIOB_(GPIOX_CRL) &= ~(MODE7_0 | MODE7_1 | MODE6_0);
		_GPIOB_(GPIOX_CRL) |= MODE6_1;
	}

	//check if SDA is low. If not, return 0
	if ((_GPIOB_(GPIOX_IDR)>>pinSDA) & 1) return 0;

	//produce 9 clock pulses checking SDA after each one.
	//If high, START then STOP, return 0
	for (uint8_t cycles = 0; cycles<9; cycles++)
	{
		//clock low then delay
		_GPIOB_(GPIOX_BRR) = 1<<pinSCL;
		for (volatile uint16_t a=0; a<0xFFFF; a++);
		//clock high then delay
		_GPIOB_(GPIOX_BSRR) = 1<<pinSCL;
		for (volatile uint16_t a=0; a<0xFFFF; a++);

		//check SDA
		if ((_GPIOB_(GPIOX_IDR)>>pinSDA) & 1)
		{
			//create START
			_GPIOB_(GPIOX_BRR) = 1<<pinSDA;
			for (volatile uint16_t a=0; a<0xFFFF; a++);

			//create STOP
			_GPIOB_(GPIOX_BSRR) = 1<<pinSDA;
			for (volatile uint16_t a=0; a<0xFFFF; a++);

			return 0;
		}
	}

	//if 9 clock pulses didn't help, return error
	return 1;
}

void i2c1_init(uint8_t speed, uint8_t altpins)
{
	//default:
	//		SDA = PB7
	//      SCL = PB6
	//alt:
	//      SDA = PB9
	//      SCL = PB8

	//turn clocks on
	_RCC_(RCC_APB1ENR) |= RCC_APB1ENR_I2C1EN;
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN | RCC_APB2ENR_AFIOEN;

	//setup SDA and SCL pins
	if (altpins == I2C1_ALT)
	{
		//remap i2c1 pins
		_AFIO_(AFIO_MAPR) |= AFIO_MAPR_I2C1_REMAP;
		//GPIOB: output open drain, AF
		_GPIOB_(GPIOX_CRH) |= CNF9_0 | CNF9_1 | CNF8_0 | CNF8_1;
		//50 MHz
		_GPIOB_(GPIOX_CRH) |= MODE9_0 | MODE9_1 | MODE8_0 | MODE8_1;
	}
	else
	{
		//GPIOB: output open drain, AF
		_GPIOB_(GPIOX_CRL) |= CNF7_0 | CNF7_1 | CNF6_0 | CNF6_1;
		//50 MHz
		_GPIOB_(GPIOX_CRL) |= MODE7_0 | MODE7_1 | MODE6_0 | MODE6_1;
	}

	//turn i2c _mode_ on (turn off SMBus)
	_I2C1_(I2C_CR1) &= ~I2C_CR1_SMBUS;

	//freq = 36 MHz
	_I2C1_(I2C_CR2) &= ~I2C_CR2_FREQ;
	_I2C1_(I2C_CR2) |= 36;

	if (speed == I2C_FM)
	{
		//400 KHz (TPCLK = 28)
		//30 is max close to 400 kHz (4 with DUTY = 357KHz)
		//rcc = pclk1 / (i2c_speed * 3)
		//rcc with duty on = pclk1 / (i2c_speed * 25)
		_I2C1_(I2C_CCR) |= I2C_CCR_FS;
		_I2C1_(I2C_CCR) &= ~I2C_CCR_DUTY;
		_I2C1_(I2C_CCR) &= ~I2C_CCR_CCR;
		_I2C1_(I2C_CCR) |= 30;

		//TRISE = tr/tcplk1 + 1 ; only integer part. tr == 300
		_I2C1_(I2C_TRISE) &= ~I2C_TRISE_TRISE;
		_I2C1_(I2C_TRISE) |= 11;
	}
	else
	{
		//178 for 100 kHz in SM (TPCLK = 28)
		_I2C1_(I2C_CCR) &= ~I2C_CCR_FS;
		_I2C1_(I2C_CCR) &= ~I2C_CCR_DUTY;
		_I2C1_(I2C_CCR) &= ~I2C_CCR_CCR;
		_I2C1_(I2C_CCR) |= 178;

		//TRISE = tr/tcplk1 + 1 ; only integer part. tr == 1000
		_I2C1_(I2C_TRISE) &= ~I2C_TRISE_TRISE;
		_I2C1_(I2C_TRISE) |= 36;
	}

	//turn on
	_I2C1_(I2C_CR1) |= I2C_CR1_PE;
}

void i2c1_tweak(uint8_t fs_bit, uint8_t duty_bit, uint16_t ccr_val)
{
	//turn I2C1 off
	_I2C1_(I2C_CR1) &= ~I2C_CR1_PE;

	//write ccr values
	_I2C1_(I2C_CCR) &= ~I2C_CCR_FS;
	_I2C1_(I2C_CCR) &= ~I2C_CCR_DUTY;
	_I2C1_(I2C_CCR) &= ~I2C_CCR_CCR;
	_I2C1_(I2C_CCR) |= fs_bit<<15 | duty_bit<<14 | ccr_val;

