Ontaelio/STM32F103-Ublink-framework/stm32f103_i2c_master.cpp
	//read SR2 to continue
	(void) _I2C1_(I2C_SR2);

	while(num>3)
	{
		while (!(_I2C1_(I2C_SR1) & I2C_SR1_RXNE));
		*arr = _I2C1_(I2C_DR);
		arr++;
		num--;
	}

	//wait for the BTF bit: data-2 and data-1 are in
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_BTF));

	//clear ACK
	_I2C1_(I2C_CR1) &= ~I2C_CR1_ACK;

	//read data-2 from DR, data-0 goes into the shift register
	*arr = _I2C1_(I2C_DR);
	arr++; //pointer at data-1

	//wait for data-0 to be transmitted with a NACK
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_RXNE));

	//STOP
	_I2C1_(I2C_CR1) |= I2C_CR1_STOP;

	*arr = _I2C1_(I2C_DR);
	arr++; //pointer at data-0

	//make sure the last byte is in DR
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_RXNE));
	*arr = _I2C1_(I2C_DR);
}

// generic and Method 1 functions

void i2c1_start(uint8_t addr)
{
	//check if i2c is busy
	while (_I2C1_(I2C_SR2) & I2C_SR2_BUSY);

	//start
	_I2C1_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_SB));

	//send device address
	_I2C1_(I2C_DR) = addr << 1;

	//check ADDR is cleared then read SR2
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_ADDR));
	(void) _I2C1_(I2C_SR2);
}

void i2c1_writeByte(uint8_t stuff)
{
	//send byte
	_I2C1_(I2C_DR) = stuff;

	//TxE gets set once the byte goes into the internal shift register
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_TXE));
}

void i2c1_writeLast(uint8_t stuff)
{
	//send data
	_I2C1_(I2C_DR) = stuff;

	//wait for BTF (send complete) before stopping communication
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_BTF));
}

void i2c1_writeStream (uint8_t* arr, uint8_t num)
{
	uint8_t counter = 0;
	while (num>1)
	{
		i2c1_writeByte (*(arr+counter));
		counter++;
		num--;
	}

	i2c1_writeLast (*(arr+counter));
}

void i2c1_stop()
{
	//stop
	_I2C1_(I2C_CR1) |= I2C_CR1_STOP;
}

void i2c1_readStart(uint8_t addr)
{
	//start
	_I2C1_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_SB));

	//send device address to read
	_I2C1_(I2C_DR) = (addr << 1) | 1;

	//check ADDR is cleared then read SR2
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_ADDR));
	(void) _I2C1_(I2C_SR2);

	//acknowledge will be returned;
	_I2C1_(I2C_CR1) |= I2C_CR1_ACK;
}

uint8_t i2c1_readByte()
{

	while (!(_I2C1_(I2C_SR1) & I2C_SR1_RXNE));
	return _I2C1_(I2C_DR);
}

uint8_t i2c1_readLast()
{
	uint8_t stuff;

	//don't send acknowledge
	_I2C1_(I2C_CR1) &= ~I2C_CR1_ACK;

	//read
	while (!(_I2C1_(I2C_SR1) & I2C_SR1_RXNE));
	stuff = _I2C1_(I2C_DR);

	return(stuff);
}

void i2c1_readStream(uint8_t* arr, uint8_t num)
{

	while (num>1)
	{
		*arr = i2c1_readByte();
		arr++;
		num--;
	}

	*arr = i2c1_readLast();
}


/* ----------- I2C2 -------------------- */

i2c2::i2c2(uint8_t address, uint8_t address_bits): device_addr(address), word_addr(address_bits > 8)
{
	//if (address_bits > 8) word_addr = 1; else word_addr = 0;
}

void i2c2::startAndSendRegisterAddress(uint16_t regaddr)
{
	i2c2_start(device_addr);
	if (word_addr) i2c2_writeByte(regaddr>>8);
	i2c2_writeByte(regaddr&0xFF);
}

void i2c2::write(uint16_t addr, uint8_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c2_writeLast(stuff);
	i2c2_stop();
}

void i2c2::write16(uint16_t addr, uint16_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c2_writeByte(stuff>>8);
	i2c2_writeLast(stuff&0xFF);
	i2c2_stop();
}

void i2c2::write32(uint16_t addr, uint32_t stuff)
{
	startAndSendRegisterAddress(addr);
	i2c2_writeByte(stuff>>24);
	i2c2_writeByte(stuff>>16);
	i2c2_writeByte(stuff>>8);
	i2c2_writeLast(stuff&0xFF);
	i2c2_stop();
}

void i2c2::writeStream(uint16_t addr, uint8_t* stuff, uint8_t num)
{
	startAndSendRegisterAddress(addr);
	i2c2_writeStream(stuff, num);
	i2c2_stop();
}

uint8_t i2c2::read(uint16_t addr)
{
	uint8_t result;
	startAndSendRegisterAddress(addr);
	//i2c2_readStart(device_addr);
	result = i2c2_readOneByte(device_addr);
	//i2c2_stop();
	return(result);
}

uint16_t i2c2::read16(uint16_t addr)
{
	uint16_t result;
	startAndSendRegisterAddress(addr);
	result = i2c2_readFirstOfTwo(device_addr)<<8;
	result |= i2c2_DR();
	return result;
}

uint32_t i2c2::read32(uint16_t addr)
{
	uint32_t result;
	uint8_t arr[4];
	startAndSendRegisterAddress(addr);
	i2c2_readStreamMethod2 (device_addr, arr, 4);
	result = (arr[0]<<24) | (arr[1]<<16) | arr[2] << 8 | arr[3];
	return result;
}

void i2c2::readStream(uint16_t addr, uint8_t* arr, uint8_t num)
{
	startAndSendRegisterAddress(addr);
	if (num>3)	i2c2_readStreamMethod2(device_addr, arr, num);
	else if (num == 3)
	{
		*arr = i2c2_readFirstOfThree(device_addr);
		arr++;
		*arr = i2c2_DR();
		arr++;
		i2c2_checkRXNE();
		*arr = i2c2_DR();
	}
	else if (num == 2)
	{
		*arr = i2c2_readFirstOfTwo(device_addr);
		arr++;
		*arr = i2c2_DR();
	}
	else if (num == 1)
	{
		*arr = i2c2_readOneByte(device_addr);
	}

	/* previous version
	i2c2_readStart(device_addr);
	i2c2_readStream(arr, num);
	i2c2_stop();*/
}

uint8_t i2c2_resetBus()
{
	uint8_t pinSDA = 11, pinSCL = 10;

	//turn GPIOB on
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN;

	//setup pins and pin variables for AF
	//SDA: input floating
	//SCL: output open drain
	//setup SCL as high impedance
	_GPIOB_(GPIOX_BSRR) = 1<<pinSCL;
	_GPIOB_(GPIOX_CRH) &= ~(CNF11_1 | CNF10_1);
	_GPIOB_(GPIOX_CRH) |= CNF11_0 | CNF10_0;
	_GPIOB_(GPIOX_CRH) &= ~(MODE11_0 | MODE11_1 | MODE10_0);
	_GPIOB_(GPIOX_CRH) |= MODE10_1;

	//check if SDA is low. If not, return 0
	if ((_GPIOB_(GPIOX_IDR)>>pinSDA) & 1) return 0;

	//produce 9 clock pulses checking SDA after each one.
	//If high, START then STOP, return 0
	for (uint8_t cycles = 0; cycles<9; cycles++)
	{
		//clock low then delay
		_GPIOB_(GPIOX_BRR) = 1<<pinSCL;
		for (volatile uint16_t a=0; a<0xFFFF; a++);
		//clock high then delay
		_GPIOB_(GPIOX_BSRR) = 1<<pinSCL;
		for (volatile uint16_t a=0; a<0xFFFF; a++);

		//check SDA
		if ((_GPIOB_(GPIOX_IDR)>>pinSDA) & 1)
		{
			//create START
			_GPIOB_(GPIOX_BRR) = 1<<pinSDA;
			for (volatile uint16_t a=0; a<0xFFFF; a++);

			//create STOP
			_GPIOB_(GPIOX_BSRR) = 1<<pinSDA;
			for (volatile uint16_t a=0; a<0xFFFF; a++);

			return 0;
		}
	}

	//if 9 clock pulses didn't help, return error
	return 1;
}

