Ontaelio/STM32F103-Ublink-framework/stm32f103_i2c_master.cpp
void i2c2_init(uint8_t speed)
{
	//		SDA = PB11
	//      SCL = PB10

	//turn clocks on
	_RCC_(RCC_APB1ENR) |= RCC_APB1ENR_I2C2EN;
	_RCC_(RCC_APB2ENR) |= RCC_APB2ENR_IOPBEN | RCC_APB2ENR_AFIOEN;

	//setup SDA and SCL pins
	//GPIOB: output open drain, AF
	_GPIOB_(GPIOX_CRH) |= CNF11_0 | CNF11_1 | CNF10_0 | CNF10_1;
	//50 MHz
	_GPIOB_(GPIOX_CRH) |= MODE11_0 | MODE11_1 | MODE10_0 | MODE10_1;


	//turn i2c _mode_ on (turn off SMBus)
	_I2C2_(I2C_CR1) &= ~I2C_CR1_SMBUS;

	//freq = 36 MHz
	_I2C2_(I2C_CR2) &= ~I2C_CR2_FREQ;
	_I2C2_(I2C_CR2) |= 36;

	if (speed == I2C_FM)
	{
		//400 KHz (TPCLK = 28)
		//30 is max close to 400 kHz (4 with DUTY = 357KHz)
		//rcc = pclk1 / (i2c_speed * 3)
		//rcc with duty on = pclk1 / (i2c_speed * 25)
		_I2C2_(I2C_CCR) |= I2C_CCR_FS;
		_I2C2_(I2C_CCR) &= ~I2C_CCR_DUTY;
		_I2C2_(I2C_CCR) &= ~I2C_CCR_CCR;
		_I2C2_(I2C_CCR) |= 30;

		//TRISE = tr/tcplk1 + 1 ; only integer part. tr == 300
		_I2C2_(I2C_TRISE) &= ~I2C_TRISE_TRISE;
		_I2C2_(I2C_TRISE) |= 11;
	}
	else
	{
		//178 for 100 kHz in SM (TPCLK = 28)
		_I2C2_(I2C_CCR) &= ~I2C_CCR_FS;
		_I2C2_(I2C_CCR) &= ~I2C_CCR_DUTY;
		_I2C2_(I2C_CCR) &= ~I2C_CCR_CCR;
		_I2C2_(I2C_CCR) |= 178;

		//TRISE = tr/tcplk1 + 1 ; only integer part. tr == 1000
		_I2C2_(I2C_TRISE) &= ~I2C_TRISE_TRISE;
		_I2C2_(I2C_TRISE) |= 36;
	}

	//turn on
	_I2C2_(I2C_CR1) |= I2C_CR1_PE;
}

void i2c2_tweak(uint8_t fs_bit, uint8_t duty_bit, uint16_t ccr_val)
{
	//turn I2C2 off
	_I2C2_(I2C_CR1) &= ~I2C_CR1_PE;

	//write ccr values
	_I2C2_(I2C_CCR) &= ~I2C_CCR_FS;
	_I2C2_(I2C_CCR) &= ~I2C_CCR_DUTY;
	_I2C2_(I2C_CCR) &= ~I2C_CCR_CCR;
	_I2C2_(I2C_CCR) |= fs_bit<<15 | duty_bit<<14 | ccr_val;

	//turn I2C2 back on
	_I2C2_(I2C_CR1) |= I2C_CR1_PE;
}

void i2c2_APB1freq(uint8_t pclk1_mhz)
{
	//turn I2C2 off
	_I2C2_(I2C_CR1) &= ~I2C_CR1_PE;

	//calculate CCR val
	//check SM/FM and DUTY bits
	uint8_t sf_bit = _I2C2_(I2C_CCR) >> 15;
	uint8_t duty_bit = 1 & (_I2C2_(I2C_CCR) >> 14);
	uint8_t ccr_value = 0;
	//10 and 4 used instead of 1,000,000 and 400,000
	if (sf_bit && duty_bit) ccr_value = (uint32_t)  (pclk1_mhz * 10) / (4 * 25);
	else if (sf_bit) ccr_value = (uint32_t) (pclk1_mhz * 10) / (4 * 3);
	else ccr_value = (uint32_t) (pclk1_mhz * 10) / (1 * 2);

	//set new freq
	_I2C2_(I2C_CR2) &= ~I2C_CR2_FREQ;
	_I2C2_(I2C_CR2) |= pclk1_mhz;

	//set CCR keeping sf and duty bits
	_I2C2_(I2C_CCR) &= ~I2C_CCR_CCR;
	_I2C2_(I2C_CCR) |= ccr_value;

	//turn I2C2 back on
	_I2C2_(I2C_CR1) |= I2C_CR1_PE;
}

void i2c2_setFreq(uint32_t i2c_freq)
{
	//turn I2C2 off
	_I2C2_(I2C_CR1) &= ~I2C_CR1_PE;

	//get current PCLK1
	uint8_t pclk1_mhz = _I2C2_(I2C_CR2) & I2C_CR2_FREQ;

	//calculate CCR val
	//check SM/FM and DUTY bits
	uint8_t sf_bit = _I2C2_(I2C_CCR) >> 15;
	uint8_t duty_bit = 1 & (_I2C2_(I2C_CCR) >> 14);
	uint8_t ccr_value = 0;

	if (sf_bit && duty_bit) ccr_value = (uint32_t)  (pclk1_mhz * 1000000) / (i2c_freq * 25);
	else if (sf_bit) ccr_value = (uint32_t) (pclk1_mhz * 1000000) / (i2c_freq * 3);
	else ccr_value = (uint32_t) (pclk1_mhz * 1000000) / (i2c_freq * 2);

	//set CCR keeping sf and duty bits
	_I2C2_(I2C_CCR) &= ~I2C_CCR_CCR;
	_I2C2_(I2C_CCR) |= ccr_value;

	//turn I2C2 back on
	_I2C2_(I2C_CR1) |= I2C_CR1_PE;
}

uint8_t i2c2_ping(uint8_t addr) /// ADD ARLO CHECK!!!
{
	uint16_t timeout = 0xFFFF;
	uint8_t error = 0;

	//check if i2c is busy
	while (_I2C2_(I2C_SR2) & I2C_SR2_BUSY)
	{
		if (timeout-- == 0) {error = 1; break;}
	}

	if (error)
	{
		timeout = 0xFFFF;

		//try to reset i2c
		_I2C2_(I2C_CR1) |= I2C_CR1_SWRST;

		//wait a bit
		for (volatile uint32_t a=0; a<9000; a++);

		//clear sw reset bit
		_I2C2_(I2C_CR1) &= ~I2C_CR1_SWRST;

		//test again
		while (_I2C2_(I2C_SR2) & I2C_SR2_BUSY)
		{
			if (timeout-- == 0) return 1;
		}

		//reset error if ok
		error = 0;
	}

	timeout = 0xFFFF;
	//generate start
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB in SR1 (start success) or return error 1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB))
	{
		if (timeout-- == 0) {error = 2; break;}
	}

	if (error == 2)
		{
			//check ARLO
			if (_I2C2_(I2C_SR1) & I2C_SR1_ARLO)
			{
				timeout = 0xFFFF;

				//reset ARLO
				_I2C2_(I2C_SR1) &= ~I2C_SR1_ARLO;

				//try again and return error 4 if failed
				_I2C2_(I2C_CR1) |= I2C_CR1_START;

				while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB))
					{
						if (timeout-- == 0) return 3;
					}
				error = 0;
			}
			else return 2;
		}

	//send device address
	_I2C2_(I2C_DR) = addr << 1;

	timeout = 0xFFFF;

	//make sure address is acknowledged or error 2 and break loop
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR))
	{
		if (timeout-- == 0) {error = 4; break;}
	}

	//clear SR2
	(void) _I2C2_(I2C_SR2);

	//generate stop even if error == 3
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;
	return error;
}

uint8_t i2c2_scanAddr(uint8_t startAddr)
{
	while (startAddr < 0x77)
	{
		startAddr++;
		if (!i2c2_ping(startAddr)) return startAddr;
	}
	return 0;
}

// Method 2

/*
Case of a single byte to be received:
– In the ADDR event, clear the ACK bit.
– Clear ADDR
– Program the STOP/START bit.
– Read the data after the RxNE flag is set.
*/
uint8_t i2c2_readOneByte(uint8_t addr)
{
	//restart
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//send device addr with read bit set
	_I2C2_(I2C_DR) = (addr << 1) | 1;

	//clear ACK
	_I2C2_(I2C_CR1) &= ~I2C_CR1_ACK;

	//clear ADDR
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));

	//read SR2 to continue
	(void) _I2C2_(I2C_SR2);

	//set STOP
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;

	//read data after RxNE is set
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));
	return _I2C2_(I2C_DR);
}

/*
• Case of two bytes to be received:
– Set POS and ACK
– Wait for the ADDR flag to be set
– Clear ADDR
– Clear ACK
– Wait for BTF to be set
– Program STOP
– Read DR twice
*/
uint8_t i2c2_readFirstOfTwo(uint8_t addr)
{
	//restart
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//set POS and ACK
	_I2C2_(I2C_CR1) |= I2C_CR1_POS;
	_I2C2_(I2C_CR1) |= I2C_CR1_ACK;

	//send device address with read bit set
	_I2C2_(I2C_DR) = (addr << 1) | 1;

	//clear ADDR
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));
	(void) _I2C2_(I2C_SR2);

