Ontaelio/STM32F103-Ublink-framework/stm32f103_i2c_master.cpp
	//clear ACK
	_I2C2_(I2C_CR1) &= ~I2C_CR1_ACK;

	//wait for the BTF bit: first byte in DR, second in the shift register
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_BTF));

	//set STOP
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;

	//read DR for the first byte, moving second one in DR
	return(_I2C2_(I2C_DR));

	//the second byte is still in the DR register!
}

/*
When 3 bytes remain to be read:
• RxNE = 1 => Nothing (DataN-2 not read).
• DataN-1 received
• BTF = 1 because both shift and data registers are full: DataN-2 in DR and DataN-1 in
the shift register => SCL tied low: no other data will be received on the bus.
• Clear ACK bit
• Read DataN-2 in DR => This will launch the DataN reception in the shift register
• DataN received (with a NACK)
• Program START/STOP
• Read DataN-1
• RxNE = 1
• Read DataN
*/
uint8_t i2c2_readFirstOfThree(uint8_t addr)
{
	uint8_t stuff;

	//restart
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//set ACK
	_I2C2_(I2C_CR1) |= I2C_CR1_ACK;

	//send device address with read bit set
	_I2C2_(I2C_DR) = (addr << 1) | 1;

	//clear ADDR
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));

	//read SR2 to continue
	(void) _I2C2_(I2C_SR2);

	//wait for the BTF bit: data-2 and data-1 are in
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_BTF));

	//clear ACK
	_I2C2_(I2C_CR1) &= ~I2C_CR1_ACK;

	//read data-2 from DR, data-0 goes into the shift register
	stuff = _I2C2_(I2C_DR);

	//wait for data-0 to be transmitted with a NACK
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));

	//STOP
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;

	return stuff;

	//data-1 is in the DR and can be read
	//to read data-0 first wait for RXNE to get set
}

void i2c2_readStreamMethod2 (uint8_t addr, uint8_t* arr, uint8_t num)
{
	//restart
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//set ACK
	_I2C2_(I2C_CR1) |= I2C_CR1_ACK;

	//send device address with read bit set
	_I2C2_(I2C_DR) = (addr << 1) | 1;

	//clear ADDR
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));

	//read SR2 to continue
	(void) _I2C2_(I2C_SR2);

	while(num>3)
	{
		while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));
		*arr = _I2C2_(I2C_DR);
		arr++;
		num--;
	}

	//wait for the BTF bit: data-2 and data-1 are in
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_BTF));

	//clear ACK
	_I2C2_(I2C_CR1) &= ~I2C_CR1_ACK;

	//read data-2 from DR, data-0 goes into the shift register
	*arr = _I2C2_(I2C_DR);
	arr++; //pointer at data-1

	//wait for data-0 to be transmitted with a NACK
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));

	//STOP
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;

	*arr = _I2C2_(I2C_DR);
	arr++; //pointer at data-0

	//make sure the last byte is in DR
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));
	*arr = _I2C2_(I2C_DR);
}

// generic and Method 1 functions

void i2c2_start(uint8_t addr)
{
	//check if i2c is busy
	while (_I2C2_(I2C_SR2) & I2C_SR2_BUSY);

	//start
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//send device address
	_I2C2_(I2C_DR) = addr << 1;

	//check ADDR is cleared then read SR2
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));
	(void) _I2C2_(I2C_SR2);
}

void i2c2_writeByte(uint8_t stuff)
{
	//send byte
	_I2C2_(I2C_DR) = stuff;

	//TxE gets set once the byte goes into the internal shift register
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_TXE));
}

void i2c2_writeLast(uint8_t stuff)
{
	//send data
	_I2C2_(I2C_DR) = stuff;

	//wait for BTF (send complete) before stopping communication
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_BTF));
}

void i2c2_writeStream (uint8_t* arr, uint8_t num)
{
	uint8_t counter = 0;
	while (num>1)
	{
		i2c2_writeByte (*(arr+counter));
		counter++;
		num--;
	}

	i2c2_writeLast (*(arr+counter));
}

void i2c2_stop()
{
	//stop
	_I2C2_(I2C_CR1) |= I2C_CR1_STOP;
}

void i2c2_readStart(uint8_t addr)
{
	//start
	_I2C2_(I2C_CR1) |= I2C_CR1_START;

	//check SB is cleared and read SR1
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_SB));

	//send device address to read
	_I2C2_(I2C_DR) = (addr << 1) | 1;

	//check ADDR is cleared then read SR2
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_ADDR));
	(void) _I2C2_(I2C_SR2);

	//acknowledge will be returned;
	_I2C2_(I2C_CR1) |= I2C_CR1_ACK;
}

uint8_t i2c2_readByte()
{

	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));
	return _I2C2_(I2C_DR);
}

uint8_t i2c2_readLast()
{
	uint8_t stuff;

	//don't send acknowledge
	_I2C2_(I2C_CR1) &= ~I2C_CR1_ACK;

	//read
	while (!(_I2C2_(I2C_SR1) & I2C_SR1_RXNE));
	stuff = _I2C2_(I2C_DR);

	return(stuff);
}

void i2c2_readStream(uint8_t* arr, uint8_t num)
{

	while (num>1)
	{
		*arr = i2c2_readByte();
		arr++;
		num--;
	}

	*arr = i2c2_readLast();
}
